УТ_для_edt/src/Catalogs/смартОтчетЗапускаМимаки/смартОтчетЗапускаМимаки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>смартОтчетЗапускаМимаки</name>
  <comment>//++ #1287 смарт: Фролов 13.03.2023 //Работа с гарантийными и коммерческими запасными частями</comment>
  <attributes>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Чернила</name>
    <type>
      <types>CatalogRef.смартОборудованиеКлиентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрограммноеОбеспечение</name>
    <type>
      <types>EnumRef.смартПрограммноеОбеспечение</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУстановки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Страна</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>НачальнаяВерсияПО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкончательнаяВерсияПО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Инженер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.смартЗаявкаНаПускоНаладку</types>
    </type>
  </attributes>
  <attributes>
    <name>ФотоОборудования</name>
    <type>
      <types>CatalogRef.смартЗаявкаНаПускоНаладкуПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ФотоШильдаОборудования</name>
    <type>
      <types>CatalogRef.смартЗаявкаНаПускоНаладкуПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ParametersДоИнсталяции</name>
    <type>
      <types>CatalogRef.смартЗаявкаНаПускоНаладкуПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>LogДоИнсталяции</name>
    <type>
      <types>CatalogRef.смартЗаявкаНаПускоНаладкуПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>LogПослеИнсталяции</name>
    <type>
      <types>CatalogRef.смартЗаявкаНаПускоНаладкуПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ParametersПослеИнсталяции</name>
    <type>
      <types>CatalogRef.смартЗаявкаНаПускоНаладкуПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Опции</name>
    <attributes>
      <name>КодОпции</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/Catalogs/смартОтчетЗапускаМимаки/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.смартЗаявкаНаПускоНаладку") Тогда
		// Заполнение шапки
		Инженер = ДанныеЗаполнения.НазначенныйНаЗапускИнженер;
		ДокументОснование = ДанныеЗаполнения.Ссылка; 
		Код=ДанныеЗаполнения.Номер;
		Наименование="Отчет запуска Мимаки (смарт) №"+ДанныеЗаполнения.Номер+" от "+Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy");
		Если ДанныеЗаполнения.Оборудование.Количество()>0 Тогда
			Серия=ДанныеЗаполнения.Оборудование[0].Серия;	
			Оборудование=ДанныеЗаполнения.Оборудование[0].Оборудование;
			Чернила=ДанныеЗаполнения.Оборудование[0].ТипЧернилОборудование;
			ДатаУстановки=ДанныеЗаполнения.Оборудование[0].ДатаПодписанияАктаНаПНР;
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры
